# 题目：轮转数组
# 给定一个整数数组nums，将数组中的元素向右轮转k个位置，其中k是非负数。
#
# 输入: nums = [1, 2, 3, 4, 5, 6, 7], k = 3
# 输出: [5, 6, 7, 1, 2, 3, 4]
# 解释:向右轮转1步: [7, 1, 2, 3, 4, 5, 6]
# 向右轮转2步: [6, 7, 1, 2, 3, 4, 5]
# 向右轮转3步: [5, 6, 7, 1, 2, 3, 4]
#
# 输入：nums = [-1, -100, 3, 99], k = 2
# 输出：[3, 99, -1, -100]
# 解释:向右轮转1步: [99, -1, -100, 3]
# 向右轮转2步: [3, 99, -1, -100]
def rotate(nums,k):
    n = len(nums)
    k %= n
    nums[:] = nums[n-k:] + nums[:n-k]
    return  nums
nums = [1, 2, 3, 4, 5, 6, 7]
k = 3
print(rotate(nums,k))